<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="12" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="9195529" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="9296628" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="9397616" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="9498583" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="191195595" type="Const" version="opset1">
			<data offset="8" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="192196625" type="Const" version="opset1">
			<data offset="16" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="193197634" type="Const" version="opset1">
			<data offset="8" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="194198541" type="Const" version="opset1">
			<data offset="16" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="111115520" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="112116586" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="113117574" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="114118613" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="121125607" type="Const" version="opset1">
			<data offset="32" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="122126553" type="Const" version="opset1">
			<data offset="40" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="123127619" type="Const" version="opset1">
			<data offset="48" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="124128538" type="Const" version="opset1">
			<data offset="56" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="left_conv.weight21577" type="Const" version="opset1">
			<data offset="64" size="24" shape="2,3,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="left_conv.weight">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_0/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_2923580" type="Const" version="opset1">
			<data offset="88" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="9">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Concat_2/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="201205559" type="Const" version="opset1">
			<data offset="96" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="202206589" type="Const" version="opset1">
			<data offset="104" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="203207631" type="Const" version="opset1">
			<data offset="96" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="204208571" type="Const" version="opset1">
			<data offset="104" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="8185592" type="Const" version="opset1">
			<data offset="112" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="8286523" type="Const" version="opset1">
			<data offset="120" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="8387565" type="Const" version="opset1">
			<data offset="128" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="8488550" type="Const" version="opset1">
			<data offset="136" size="8" shape="2,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="right_conv.weight25535" type="Const" version="opset1">
			<data offset="144" size="24" shape="2,3,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="right_conv.weight">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_7727610" type="Const" version="opset1">
			<data offset="168" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Concat_2/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Concat_2" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="11">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_3/WithoutBiases/weights_shape426562" type="Const" version="opset1">
			<data offset="176" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="141145517" type="Const" version="opset1">
			<data offset="216" size="16" shape="4,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="142146532" type="Const" version="opset1">
			<data offset="232" size="16" shape="4,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="143147514" type="Const" version="opset1">
			<data offset="216" size="16" shape="4,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="144148604" type="Const" version="opset1">
			<data offset="232" size="16" shape="4,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_11330622" type="Const" version="opset1">
			<data offset="248" size="16" shape="4,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_3/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="425" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_19932601" type="Const" version="opset1">
			<data offset="264" size="16" shape="1,4,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="12">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_4/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="101105547" type="Const" version="opset1">
			<data offset="280" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="102106526" type="Const" version="opset1">
			<data offset="284" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="103107544" type="Const" version="opset1">
			<data offset="280" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="104108556" type="Const" version="opset1">
			<data offset="284" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="last_conv.weight34598" type="Const" version="opset1">
			<data offset="288" size="16" shape="1,4,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="last_conv.weight">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_4/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_24736568" type="Const" version="opset1">
			<data offset="304" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="13">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="13/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="12" from-port="0" to-layer="13" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="13" to-port="1"/>
		<edge from-layer="9" from-port="0" to-layer="13" to-port="2"/>
		<edge from-layer="10" from-port="0" to-layer="13" to-port="3"/>
		<edge from-layer="11" from-port="0" to-layer="13" to-port="4"/>
		<edge from-layer="18" from-port="0" to-layer="19" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="19" to-port="1"/>
		<edge from-layer="15" from-port="0" to-layer="19" to-port="2"/>
		<edge from-layer="16" from-port="0" to-layer="19" to-port="3"/>
		<edge from-layer="17" from-port="0" to-layer="19" to-port="4"/>
		<edge from-layer="13" from-port="5" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="5" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="4" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="5" from-port="0" to-layer="23" to-port="2"/>
		<edge from-layer="6" from-port="0" to-layer="23" to-port="3"/>
		<edge from-layer="7" from-port="0" to-layer="23" to-port="4"/>
		<edge from-layer="32" from-port="0" to-layer="33" to-port="0"/>
		<edge from-layer="28" from-port="0" to-layer="33" to-port="1"/>
		<edge from-layer="29" from-port="0" to-layer="33" to-port="2"/>
		<edge from-layer="30" from-port="0" to-layer="33" to-port="3"/>
		<edge from-layer="31" from-port="0" to-layer="33" to-port="4"/>
		<edge from-layer="13" from-port="5" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="5" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="0" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="24" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="25" from-port="0" to-layer="37" to-port="2"/>
		<edge from-layer="26" from-port="0" to-layer="37" to-port="3"/>
		<edge from-layer="27" from-port="0" to-layer="37" to-port="4"/>
		<edge from-layer="23" from-port="5" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="5" to-layer="38" to-port="1"/>
		<edge from-layer="44" from-port="0" to-layer="45" to-port="0"/>
		<edge from-layer="40" from-port="0" to-layer="45" to-port="1"/>
		<edge from-layer="41" from-port="0" to-layer="45" to-port="2"/>
		<edge from-layer="42" from-port="0" to-layer="45" to-port="3"/>
		<edge from-layer="43" from-port="0" to-layer="45" to-port="4"/>
		<edge from-layer="45" from-port="5" to-layer="46" to-port="0"/>
		<edge from-layer="39" from-port="0" to-layer="46" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="47" to-port="0"/>
		<edge from-layer="46" from-port="2" to-layer="47" to-port="1"/>
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="0" from-port="0" to-layer="50" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="50" to-port="2"/>
		<edge from-layer="2" from-port="0" to-layer="50" to-port="3"/>
		<edge from-layer="3" from-port="0" to-layer="50" to-port="4"/>
		<edge from-layer="55" from-port="0" to-layer="56" to-port="0"/>
		<edge from-layer="51" from-port="0" to-layer="56" to-port="1"/>
		<edge from-layer="52" from-port="0" to-layer="56" to-port="2"/>
		<edge from-layer="53" from-port="0" to-layer="56" to-port="3"/>
		<edge from-layer="54" from-port="0" to-layer="56" to-port="4"/>
		<edge from-layer="50" from-port="5" to-layer="57" to-port="0"/>
		<edge from-layer="56" from-port="5" to-layer="57" to-port="1"/>
		<edge from-layer="57" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="0" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="60" to-port="0"/>
	</edges>
	<rt_info>
		<MO_version value="custom_master_03583d93cb02d913e914ff461ee14d4d0f0e46cd"/>
		<Runtime_version value="2022.3.0-8879-03583d93cb0"/>
		<conversion_parameters>
			<data_type value="FP32"/>
			<input_model value="DIR/concat_depthwise_model.onnx"/>
			<model_name value="concat_depthwise_model"/>
			<output_dir value="DIR"/>
		</conversion_parameters>
		<legacy_frontend value="False"/>
		<quantization_parameters/>
	</rt_info>
	<quantization_parameters>
		<config/>
		<version value="{}"/>
		<cli_params value="{}"/>
	</quantization_parameters>
</net>
