<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="9" name="input" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="234323478022" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="234423487965" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="234523498673" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="234623508265" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="4224248340" type="Const" version="opset1">
			<data offset="4" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="148314878103" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="148414888112" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="148514898859" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="148614908865" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="149314978565" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="149414988685" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="149514998628" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="149615008622" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="4251578070" type="Const" version="opset1">
			<data offset="260" size="37632" shape="64,3,7,7" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="425"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="425">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_0/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="3,3" pads_end="3,3"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_110, Conv_0, Conv_0/WithoutBiases, Reshape_111"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="424">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_0/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Relu_1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_1"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="273">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="MaxPool_2/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MaxPool_2" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="3,3" pads_begin="0,0" pads_end="2,2" rounding_type="floor" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MaxPool_2"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="274">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="23" name="4304328220" type="Const" version="opset1">
			<data offset="37892" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="4264288643" type="Const" version="opset1">
			<data offset="4" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="139313978781" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="139413988376" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="139513998013" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="139614008109" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="4281618025" type="Const" version="opset1">
			<data offset="38660" size="16384" shape="64,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="428"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="428">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_3/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_160, Conv_3, Conv_3/WithoutBiases, Reshape_161"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="427">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_3/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Relu_4" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_4"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="277">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_5/WithoutBiases/fq_weights_1961" type="Const" version="opset1">
			<data offset="55044" size="442368" shape="192,64,3,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="431"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="431">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_209, Conv_5, Conv_5/WithoutBiases, Reshape_210"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="430">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_5/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Relu_6" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_6"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="280">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MaxPool_7" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="3,3" pads_begin="0,0" pads_end="2,2" rounding_type="floor" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MaxPool_7"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="281">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="40" name="MaxPool_18" type="MaxPool" version="opset8">
			<data strides="1,1" kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MaxPool_18"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="297">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="42" name="225322578139" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="225422588661" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="225522598055" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="225622608406" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="4544567884" type="Const" version="opset1">
			<data offset="497412" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_19/WithoutBiases/fq_weights_11621" type="Const" version="opset1">
			<data offset="497540" size="24576" shape="32,192,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="449"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="449">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_505, Conv_19, Conv_19/WithoutBiases, Reshape_506"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="448">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_19/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Relu_20" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_20"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="300">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Concat_21/fq_input_3" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="224322478274" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="224422488088" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="224522498145" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="224622508553" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="4504528385" type="Const" version="opset1">
			<data offset="497412" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="8238278298" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="8248288043" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="8258297842" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="8268308484" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="4464488130" type="Const" version="opset1">
			<data offset="522116" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_14/WithoutBiases/fq_weights_1901" type="Const" version="opset1">
			<data offset="522180" size="12288" shape="16,192,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="443"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="443">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_14/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_406, Conv_14, Conv_14/WithoutBiases, Reshape_407"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="442">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_14/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Relu_15" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_15"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="293">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_16/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="8338378280" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="8348388442" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="8358398010" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="8368408901" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="4461808001" type="Const" version="opset1">
			<data offset="534468" size="18432" shape="32,16,3,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="446"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="446">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_16/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_455, Conv_16, Conv_16/WithoutBiases, Reshape_456"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="445">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_16/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Relu_17" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_17"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="296">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Concat_21/fq_input_2" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="223322378259" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="223422388061" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="223522397848" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="223622408160" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="4424447833" type="Const" version="opset1">
			<data offset="552900" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="9839878337" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="9849888820" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="9859898214" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="9869908505" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="4384407911" type="Const" version="opset1">
			<data offset="553412" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_10/WithoutBiases/fq_weights_11441" type="Const" version="opset1">
			<data offset="553796" size="73728" shape="96,192,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="437"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="437">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_308, Conv_10, Conv_10/WithoutBiases, Reshape_309"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="436">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_10/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Relu_11" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_11"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="287">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_12/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="9939977953" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="9949988829" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="9959998433" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="99610008247" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="4401748775" type="Const" version="opset1">
			<data offset="627524" size="442368" shape="128,96,3,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="440"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="440">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_12/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_357, Conv_12, Conv_12/WithoutBiases, Reshape_358"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="439">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_12/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Relu_13" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_13"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="290">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Concat_21/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="222322278721" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="222422288097" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="222522298175" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="222622307923" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="4344368148" type="Const" version="opset1">
			<data offset="4" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_8/WithoutBiases/fq_weights_11581" type="Const" version="opset1">
			<data offset="1069892" size="49152" shape="64,192,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="434"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="434">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_259, Conv_8, Conv_8/WithoutBiases, Reshape_260"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="433">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_8/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Relu_9" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_9"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="284">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Concat_21/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Concat_21" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_21"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="301">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="MaxPool_32" type="MaxPool" version="opset8">
			<data strides="1,1" kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MaxPool_32"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="317">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="115" name="244324477986" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="244424488424" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="244524498886" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="244624508550" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="4784808037" type="Const" version="opset1">
			<data offset="4" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="147314778841" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="147414788811" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="147514798418" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="147614807935" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="4672047980" type="Const" version="opset1">
			<data offset="1119044" size="65536" shape="64,256,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="467"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="467">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_33/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_801, Conv_33, Conv_33/WithoutBiases, Reshape_802"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="466">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Conv_33/WithoutBiases/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Relu_34" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu_34"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="320">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Concat_35/fq_input_3" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="243324377890" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="243424388697" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="243524398211" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="243624408676" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="4744768880" type="Const" version="opset1">
			<data offset="553412" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="136313678184" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="136413688514" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="136513697803" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="136613708478" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="4704728142" type="Const" version="opset1">
			<data offset="497412" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="135313578217" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="141" name="135413588445" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="135513598460" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="135613607815" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="4611978556" type="Const" version="opset1">
			<data offset="1184580" size="32768" shape="32,256,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="461"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="461">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="Conv_28/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
