<?xml version="1.0" ?>
<net name="pnet" version="11">
	<layers>
		<layer id="4" name="pnet_data" type="Parameter" version="opset1">
			<data shape="1,3,720,1280" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,W,H]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="231235564" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="232236558" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="233237528" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="234238573" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="Constant_111037522" type="Const" version="opset1">
			<data offset="4" size="4" shape="1,1,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pnet_Multiply_1098" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_110039534" type="Const" version="opset1">
			<data offset="8" size="12" shape="1,3,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pnet_Divide_67" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="2341501" type="Const" version="opset1">
			<data offset="20" size="1080" shape="10,3,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pnet_conv1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv1/Dims25843513" type="Const" version="opset1">
			<data offset="1100" size="40" shape="1,10,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="pnet_conv1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1745492" type="Const" version="opset1">
			<data offset="1140" size="40" shape="10" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="pnet_PReLU1" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
				<port id="1">
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="pnet_pool1/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="pnet_pool1" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>718</dim>
					<dim>1278</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>359</dim>
					<dim>639</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>359</dim>
					<dim>639</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="18" name="142146498" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="143147570" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="144148531" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="145149489" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="2565495" type="Const" version="opset1">
			<data offset="1180" size="512" shape="4,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="pnet_conv4-2/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="152156546" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="153157555" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="154158591" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="155159537" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="182186525" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="183187588" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="184188504" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="185189549" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="2748540" type="Const" version="opset1">
			<data offset="1692" size="5760" shape="16,10,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="pnet_conv2/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="pnet_conv2/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>359</dim>
					<dim>639</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2/Dims24650582" type="Const" version="opset1">
			<data offset="7452" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="pnet_conv2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="1652561" type="Const" version="opset1">
			<data offset="7516" size="64" shape="16" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="pnet_PReLU2" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
				<port id="1">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="2154519" type="Const" version="opset1">
			<data offset="7580" size="18432" shape="32,16,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="pnet_conv3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>357</dim>
					<dim>637</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv3/Dims26456567" type="Const" version="opset1">
			<data offset="26012" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="pnet_conv3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="1858507" type="Const" version="opset1">
			<data offset="26140" size="128" shape="32" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="pnet_PReLU3" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="pnet_conv4-1/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="pnet_conv4-2/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv4-2/Dims24067516" type="Const" version="opset1">
			<data offset="26268" size="16" shape="1,4,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="pnet_conv4-2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4-2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv4-2" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</input>
		</layer>
		<layer id="50" name="162166543" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="163167552" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="164168510" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="165169576" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="1960579" type="Const" version="opset1">
			<data offset="26284" size="256" shape="2,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="pnet_conv4-1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="0" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="pnet_conv4-1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv4-1/Dims25262585" type="Const" version="opset1">
			<data offset="26540" size="8" shape="1,2,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="pnet_conv4-1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4-1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="pnet_prob1" type="SoftMax" version="opset8">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="prob1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="prob1" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>355</dim>
					<dim>635</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="4" from-port="0" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="0" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="15" to-port="2"/>
		<edge from-layer="2" from-port="0" to-layer="15" to-port="3"/>
		<edge from-layer="3" from-port="0" to-layer="15" to-port="4"/>
		<edge from-layer="15" from-port="5" to-layer="16" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0"/>
		<edge from-layer="18" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="19" from-port="0" to-layer="23" to-port="2"/>
		<edge from-layer="20" from-port="0" to-layer="23" to-port="3"/>
		<edge from-layer="21" from-port="0" to-layer="23" to-port="4"/>
		<edge from-layer="32" from-port="0" to-layer="33" to-port="0"/>
		<edge from-layer="28" from-port="0" to-layer="33" to-port="1"/>
		<edge from-layer="29" from-port="0" to-layer="33" to-port="2"/>
		<edge from-layer="30" from-port="0" to-layer="33" to-port="3"/>
		<edge from-layer="31" from-port="0" to-layer="33" to-port="4"/>
		<edge from-layer="16" from-port="1" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="5" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="0" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="24" from-port="0" to-layer="45" to-port="1"/>
		<edge from-layer="25" from-port="0" to-layer="45" to-port="2"/>
		<edge from-layer="26" from-port="0" to-layer="45" to-port="3"/>
		<edge from-layer="27" from-port="0" to-layer="45" to-port="4"/>
		<edge from-layer="45" from-port="5" to-layer="46" to-port="0"/>
		<edge from-layer="23" from-port="5" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="54" from-port="0" to-layer="55" to-port="0"/>
		<edge from-layer="50" from-port="0" to-layer="55" to-port="1"/>
		<edge from-layer="51" from-port="0" to-layer="55" to-port="2"/>
		<edge from-layer="52" from-port="0" to-layer="55" to-port="3"/>
		<edge from-layer="53" from-port="0" to-layer="55" to-port="4"/>
		<edge from-layer="45" from-port="5" to-layer="56" to-port="0"/>
		<edge from-layer="55" from-port="5" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="2" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="0" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="59" from-port="1" to-layer="60" to-port="0"/>
	</edges>
	<rt_info>
		<MO_version value="custom_HEAD_a22c5f16b60ade2761d7da817c653fc02bff9874"/>
		<Runtime_version value="2023.1.0-11966-a22c5f16b60-HEAD"/>
		<conversion_parameters>
			<framework value="caffe"/>
			<input value="data"/>
			<input_model value="DIR/mtcnn-p.caffemodel"/>
			<input_proto value="DIR/mtcnn-p.prototxt"/>
			<input_shape value="[1, 3, 720, 1280]"/>
			<is_python_api_used value="False"/>
			<layout value="data(NCWH)"/>
			<mean_values value="data[127.5,127.5,127.5]"/>
			<model_name value="mtcnn-p"/>
			<output value="conv4-2,prob1"/>
			<output_dir value="/tmp/pytest-of-nmali/pytest-32/test_build_quantization_graph_0/public/mtcnn/mtcnn-p/FP32"/>
			<scale_values value="data[128.0]"/>
		</conversion_parameters>
		<legacy_frontend value="True"/>
	</rt_info>
	<quantization_parameters>
		<config/>
		<version value="{}"/>
		<cli_params value="{}"/>
	</quantization_parameters>
</net>
