<?xml version="1.0" ?>
<net name="multiple_outputs_net_example" version="11">
	<layers>
		<layer id="0" name="Constant_82026257" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="106110299" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="107111293" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="108112302" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="109113266" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="model/lstm/PartitionedCall/strided_slice16260" type="Const" version="opset1">
			<data element_type="i32" offset="28" shape="" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/strided_slice" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model/lstm/PartitionedCall/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="6" name="model/lstm/PartitionedCall/while/ExecutionConditionValue17269" type="Const" version="opset1">
			<data element_type="boolean" offset="32" shape="" size="1"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/while/ExecutionConditionValue" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="BOOL"/>
			</output>
		</layer>
		<layer id="7" name="model/lstm/PartitionedCall/time18281" type="Const" version="opset1">
			<data element_type="i32" offset="24" shape="" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/time" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model/lstm/PartitionedCall/time:0" precision="I32"/>
			</output>
		</layer>
		<layer id="8" name="model/lstm/zeros19296" type="Const" version="opset1">
			<data element_type="f32" offset="33" shape="1,128" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/zeros" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model/lstm/zeros:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/lstm/zeros_120251" type="Const" version="opset1">
			<data element_type="f32" offset="33" shape="1,128" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/zeros_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model/lstm/zeros_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,128"/>
			<rt_info>
				<attribute name="fused_names" value="input_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="input_1,input_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/lstm/PartitionedCall/transpose/perm21254" type="Const" version="opset1">
			<data element_type="i64" offset="545" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/transpose/perm" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model/lstm/PartitionedCall/transpose/perm:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/lstm/PartitionedCall/transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/lstm/PartitionedCall/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/lstm/PartitionedCall/while/pre_fq_input" type="Loop" version="opset5">
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="6" names="model/lstm/PartitionedCall/while:3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="0" internal_layer_id="0"/>
				<input external_port_id="2" internal_layer_id="41"/>
				<input external_port_id="3" internal_layer_id="18"/>
				<input external_port_id="4" internal_layer_id="27"/>
				<input axis="0" end="-1" external_port_id="5" internal_layer_id="4" part_size="1" start="0" stride="1"/>
				<input external_port_id="-1" internal_layer_id="45" purpose="current_iteration"/>
				<output axis="0" end="-1" external_port_id="6" internal_layer_id="38" part_size="1" start="0" stride="1"/>
				<output external_port_id="7" internal_layer_id="39"/>
				<output external_port_id="8" internal_layer_id="40"/>
				<output external_port_id="-1" internal_layer_id="13" purpose="execution_condition"/>
			</port_map>
			<back_edges>
				<edge from-layer="1" to-layer="0"/>
				<edge from-layer="44" to-layer="41"/>
				<edge from-layer="39" to-layer="18"/>
				<edge from-layer="40" to-layer="27"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="while_while_maximum_iterations" type="Parameter" version="opset1">
						<data element_type="i32" shape=""/>
						<rt_info>
							<attribute name="fused_names" value="while_while_maximum_iterations" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="1" name="while_while_maximum_iterations/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_while_maximum_iterations/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
						</input>
					</layer>
					<layer id="2" name="while_strided_slice_089162" type="Const" version="opset1">
						<data element_type="i32" offset="28" shape="" size="4"/>
						<rt_info>
							<attribute name="fused_names" value="while_strided_slice_0" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="I32"/>
						</output>
					</layer>
					<layer id="3" name="while_strided_slice_0/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_strided_slice_0/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
						</input>
					</layer>
					<layer id="4" name="while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,128"/>
						<rt_info>
							<attribute name="fused_names" value="while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="5" name="while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
					</layer>
					<layer id="6" name="while_matmul_kernel_069888150" type="Const" version="opset1">
						<data element_type="f32" offset="569" shape="128,512" size="262144"/>
						<rt_info>
							<attribute name="fused_names" value="while_matmul_kernel_0698" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>128</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="while_matmul_kernel_0/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_matmul_kernel_0/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>128</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="8" name="while_matmul_1_recurrent_kernel_070787156" type="Const" version="opset1">
						<data element_type="f32" offset="262713" shape="128,512" size="262144"/>
						<rt_info>
							<attribute name="fused_names" value="while_matmul_1_recurrent_kernel_0707" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>128</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="while_matmul_1_recurrent_kernel_0/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_matmul_1_recurrent_kernel_0/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>128</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="10" name="while_biasadd_bias_086147" type="Const" version="opset1">
						<data element_type="f32" offset="524857" shape="512" size="2048"/>
						<rt_info>
							<attribute name="fused_names" value="while_biasadd_bias_0" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="while_biasadd_bias_0/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while_biasadd_bias_0/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="12" name="4985132" type="Const" version="opset1">
						<data element_type="boolean" offset="32" shape="" size="1"/>
						<rt_info>
							<attribute name="fused_names" value="49" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="BOOL"/>
						</output>
					</layer>
					<layer id="13" name="while/Less/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Less/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
						</input>
					</layer>
					<layer id="14" name="TensorListGetItemSqueeze_input_port_1/value60135" type="Const" version="opset1">
						<data element_type="i64" offset="526905" shape="1" size="8"/>
						<rt_info>
							<attribute name="fused_names" value="TensorListGetItemSqueeze_input_port_1/value" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="while/TensorArrayV2Read/TensorListGetItem" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/TensorArrayV2Read/TensorListGetItem" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/TensorArrayV2Read/TensorListGetItem:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="16" name="while_matmul_kernel_062144" type="Const" version="opset1">
						<data element_type="f32" offset="526913" shape="512,128" size="262144"/>
						<rt_info>
							<attribute name="fused_names" value="while_matmul_kernel_0" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>512</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="while/MatMul" type="MatMul" version="opset1">
						<data transpose_a="false" transpose_b="true"/>
						<rt_info>
							<attribute name="fused_names" value="while/MatMul" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>512</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/MatMul:0" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="while_placeholder_2" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,128"/>
						<rt_info>
							<attribute name="fused_names" value="while_placeholder_2" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while_placeholder_2:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="19" name="while_matmul_1_recurrent_kernel_064129" type="Const" version="opset1">
						<data element_type="f32" offset="789057" shape="512,128" size="262144"/>
						<rt_info>
							<attribute name="fused_names" value="while_matmul_1_recurrent_kernel_0" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>512</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="while/MatMul_1" type="MatMul" version="opset1">
						<data transpose_a="false" transpose_b="true"/>
						<rt_info>
							<attribute name="fused_names" value="while/MatMul_1" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>512</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/MatMul_1:0" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="while/add" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/add" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/add:0" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="while_biasadd_bias_068967165" type="Const" version="opset1">
						<data element_type="f32" offset="1051201" shape="1,512" size="2048"/>
						<rt_info>
							<attribute name="fused_names" value="while_biasadd_bias_0689" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="while/BiasAdd/Add" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/BiasAdd/Add" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/BiasAdd:0" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="while/split/split_dim69141" type="Const" version="opset1">
						<data element_type="i64" offset="1053249" shape="" size="8"/>
						<rt_info>
							<attribute name="fused_names" value="while/split/split_dim" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="I64"/>
						</output>
					</layer>
					<layer id="25" name="while/split" type="Split" version="opset1">
						<data num_splits="4"/>
						<rt_info>
							<attribute name="fused_names" value="while/split" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1"/>
						</input>
						<output>
							<port id="2" names="while/split:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="3" names="while/split:1" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="4" names="while/split:2" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<rt_info/>
							</port>
							<port id="5" names="while/split:3" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="26" name="while/Sigmoid_2" type="Sigmoid" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Sigmoid_2" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" names="while/Sigmoid_2:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="while_placeholder_3" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,128"/>
						<rt_info>
							<attribute name="fused_names" value="while_placeholder_3" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while_placeholder_3:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="28" name="while/Sigmoid_1" type="Sigmoid" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Sigmoid_1" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" names="while/Sigmoid_1:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="while/mul" type="Multiply" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/mul" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/mul:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="while/Sigmoid" type="Sigmoid" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Sigmoid" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" names="while/Sigmoid:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="31" name="while/Tanh" type="Tanh" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Tanh" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" names="while/Tanh:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="while/mul_1" type="Multiply" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/mul_1" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/mul_1:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="while/add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/add_1" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" names="while/add_1:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="while/Tanh_1" type="Tanh" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/Tanh_1" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1" names="while/Tanh_1:0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="while/mul_2" type="Multiply" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/mul_2" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="36" name="TensorListSetItemUnsqueeze_input_port_1/value83138" type="Const" version="opset1">
						<data element_type="i64" offset="526905" shape="1" size="8"/>
						<rt_info>
							<attribute name="fused_names" value="TensorListSetItemUnsqueeze_input_port_1/value" version="0"/>
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="37" name="while/TensorArrayV2Write/TensorListSetItem" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/TensorArrayV2Write/TensorListSetItem" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
					<layer id="38" name="while/TensorArrayV2Write/TensorListSetItem/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/TensorArrayV2Write/TensorListSetItem/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
					</layer>
					<layer id="39" name="while/mul_2/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/mul_2/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
					</layer>
					<layer id="40" name="while/add_1/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/add_1/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
					</layer>
					<layer id="41" name="while_placeholder" type="Parameter" version="opset1">
						<data element_type="i32" shape=""/>
						<rt_info>
							<attribute name="fused_names" value="while_placeholder" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while_placeholder:0" precision="I32">
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="42" name="while/add_2/y58153" type="Const" version="opset1">
						<data element_type="i32" offset="28" shape="" size="4"/>
						<rt_info>
							<attribute name="fused_names" value="while/add_2/y" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while/add_2/y:0" precision="I32"/>
						</output>
					</layer>
					<layer id="43" name="while/add_2" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/add_2" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
							<port id="1"/>
						</input>
						<output>
							<port id="2" precision="I32"/>
						</output>
					</layer>
					<layer id="44" name="while/add_2/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/add_2/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
						</input>
					</layer>
					<layer id="45" name="while_while_loop_counter" type="Parameter" version="opset1">
						<data element_type="i64" shape=""/>
						<rt_info>
							<attribute name="fused_names" value="while_while_loop_counter" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while_while_loop_counter:0" precision="I64">
								<rt_info/>
							</port>
						</output>
					</layer>
					<layer id="46" name="while/add_3/y56159" type="Const" version="opset1">
						<data element_type="i64" offset="1053249" shape="" size="8"/>
						<rt_info>
							<attribute name="fused_names" value="while/add_3/y" version="0"/>
						</rt_info>
						<output>
							<port id="0" names="while/add_3/y:0" precision="I64"/>
						</output>
					</layer>
					<layer id="47" name="while/add_3" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<rt_info>
							<attribute name="fused_names" value="while/add_3" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
							<port id="1"/>
						</input>
						<output>
							<port id="2" precision="I64"/>
						</output>
					</layer>
					<layer id="48" name="while/add_3/sink_port_0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" value="while/add_3/sink_port_0" version="0"/>
						</rt_info>
						<input>
							<port id="0"/>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
					<edge from-layer="2" from-port="0" to-layer="3" to-port="0"/>
					<edge from-layer="4" from-port="0" to-layer="5" to-port="0"/>
					<edge from-layer="6" from-port="0" to-layer="7" to-port="0"/>
					<edge from-layer="8" from-port="0" to-layer="9" to-port="0"/>
					<edge from-layer="10" from-port="0" to-layer="11" to-port="0"/>
					<edge from-layer="12" from-port="0" to-layer="13" to-port="0"/>
					<edge from-layer="4" from-port="0" to-layer="15" to-port="0"/>
					<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
					<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
					<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
					<edge from-layer="18" from-port="0" to-layer="20" to-port="0"/>
					<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
					<edge from-layer="17" from-port="2" to-layer="21" to-port="0"/>
					<edge from-layer="20" from-port="2" to-layer="21" to-port="1"/>
					<edge from-layer="21" from-port="2" to-layer="23" to-port="0"/>
					<edge from-layer="22" from-port="0" to-layer="23" to-port="1"/>
					<edge from-layer="23" from-port="2" to-layer="25" to-port="0"/>
					<edge from-layer="24" from-port="0" to-layer="25" to-port="1"/>
					<edge from-layer="25" from-port="5" to-layer="26" to-port="0"/>
					<edge from-layer="25" from-port="3" to-layer="28" to-port="0"/>
					<edge from-layer="28" from-port="1" to-layer="29" to-port="0"/>
					<edge from-layer="27" from-port="0" to-layer="29" to-port="1"/>
					<edge from-layer="25" from-port="2" to-layer="30" to-port="0"/>
					<edge from-layer="25" from-port="4" to-layer="31" to-port="0"/>
					<edge from-layer="30" from-port="1" to-layer="32" to-port="0"/>
					<edge from-layer="31" from-port="1" to-layer="32" to-port="1"/>
					<edge from-layer="29" from-port="2" to-layer="33" to-port="0"/>
					<edge from-layer="32" from-port="2" to-layer="33" to-port="1"/>
					<edge from-layer="33" from-port="2" to-layer="34" to-port="0"/>
					<edge from-layer="26" from-port="1" to-layer="35" to-port="0"/>
					<edge from-layer="34" from-port="1" to-layer="35" to-port="1"/>
					<edge from-layer="35" from-port="2" to-layer="37" to-port="0"/>
					<edge from-layer="36" from-port="0" to-layer="37" to-port="1"/>
					<edge from-layer="37" from-port="2" to-layer="38" to-port="0"/>
					<edge from-layer="35" from-port="2" to-layer="39" to-port="0"/>
					<edge from-layer="33" from-port="2" to-layer="40" to-port="0"/>
					<edge from-layer="41" from-port="0" to-layer="43" to-port="0"/>
					<edge from-layer="42" from-port="0" to-layer="43" to-port="1"/>
					<edge from-layer="43" from-port="2" to-layer="44" to-port="0"/>
					<edge from-layer="45" from-port="0" to-layer="47" to-port="0"/>
					<edge from-layer="46" from-port="0" to-layer="47" to-port="1"/>
					<edge from-layer="47" from-port="2" to-layer="48" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="14" name="model/lstm/PartitionedCall/transpose_1/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/lstm/PartitionedCall/transpose_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" value="model/lstm/PartitionedCall/transpose_1" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Identity:0,model/lstm/PartitionedCall/transpose_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Identity:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Identity:0" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
		<layer id="17" name="6771248" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="6872287" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="6973290" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="7074278" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="model/lstm/PartitionedCall/while.1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" names="Identity_1:0,model/lstm/PartitionedCall/while:4" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Identity_1:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Identity_1:0" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
		<layer id="23" name="5761275" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="5862263" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="5963272" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="6064284" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="model/lstm/PartitionedCall/while.2" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" names="Identity_2:0,model/lstm/PartitionedCall/while:5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Identity_2:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Identity_2:0" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="10" from-port="0" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="5" from-port="0" to-layer="13" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="13" to-port="1"/>
		<edge from-layer="7" from-port="0" to-layer="13" to-port="2"/>
		<edge from-layer="8" from-port="0" to-layer="13" to-port="3"/>
		<edge from-layer="9" from-port="0" to-layer="13" to-port="4"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="5"/>
		<edge from-layer="13" from-port="6" to-layer="14" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="2" from-port="0" to-layer="14" to-port="2"/>
		<edge from-layer="3" from-port="0" to-layer="14" to-port="3"/>
		<edge from-layer="4" from-port="0" to-layer="14" to-port="4"/>
		<edge from-layer="14" from-port="5" to-layer="15" to-port="0"/>
		<edge from-layer="0" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="13" from-port="7" to-layer="21" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="21" to-port="1"/>
		<edge from-layer="18" from-port="0" to-layer="21" to-port="2"/>
		<edge from-layer="19" from-port="0" to-layer="21" to-port="3"/>
		<edge from-layer="20" from-port="0" to-layer="21" to-port="4"/>
		<edge from-layer="21" from-port="5" to-layer="22" to-port="0"/>
		<edge from-layer="13" from-port="8" to-layer="27" to-port="0"/>
		<edge from-layer="23" from-port="0" to-layer="27" to-port="1"/>
		<edge from-layer="24" from-port="0" to-layer="27" to-port="2"/>
		<edge from-layer="25" from-port="0" to-layer="27" to-port="3"/>
		<edge from-layer="26" from-port="0" to-layer="27" to-port="4"/>
		<edge from-layer="27" from-port="5" to-layer="28" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="custom_master_b837b7e32ce345b10fc88c4f5749452fdf766ef3"/>
		<Runtime_version value="custom_master_b837b7e32ce345b10fc88c4f5749452fdf766ef3"/>
		<legacy_path value="True"/>
		<cli_parameters>
			<auto_disable_nhwc_to_nchw value="True"/>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model value="DIR/multiple_outputs_net_example.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,1,128]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="multiple_outputs_net_example"/>
			<output_dir value="DIR"/>
			<packed_user_shapes value="defaultdict(&lt;class 'list'&gt;, {'input_1': [{'shape': (1, 1, 128), 'port': None, 'added': True}]})"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="(1, 1, 128)"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
	<quantization_parameters>
		<config/>
		<version value="{}"/>
		<cli_params value="{}"/>
	</quantization_parameters>
</net>
